tools/backOfficeProvisioning/templates/findSubscriberBySearchCriteriaTemplate_old.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:head="http://www.wildblue.viasat.com/XMLSchema/v3.0/Header" xmlns:sub="http://www.viasat.com/XMLSchema/v2/webservice/SubscriberSearchService">
   <soapenv:Header>
      <head:wildBlueHeader>
         <head:invokedBy>
            <head:username>bm</head:username>
            <head:application>wb</head:application>
         </head:invokedBy>
      </head:wildBlueHeader>
   </soapenv:Header>
   <soapenv:Body>
      <sub:findSubscribersBySearchCriteria>
         <sub:organization>WildBlue</sub:organization>
         <sub:username>devteamall</sub:username>
         <!--Optional:-->
         
         <!--Optional:-->
         
         <!--Optional:-->
         
         <!--Optional:-->
         
         <!--Optional:-->
         
         <!--Optional:-->
         
         <!--Optional:-->
         
         <!--Optional:-->
         <sub:subscriberUsername>402912668</sub:subscriberUsername><sub:address type="">
            <countryCode/>
            <!--Optional:-->
            
            <!--Optional:-->
            
            <!--Optional:-->
            
            <!--Zero or more repetitions:-->
            
         </sub:address>
         <!--Optional:-->
         
         <!--Optional:-->
         
         <!--Optional:-->
         
         <!--Optional:-->
         
         <!--Optional:-->
         
         <!--Optional:-->
         
      </sub:findSubscribersBySearchCriteria>
   </soapenv:Body>
</soapenv:Envelope>
